20240103153258-stringbuilder.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-31 Sat 14:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>StringBuilder</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">StringBuilder</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb99e7b4">1. <code>StringBuilder</code></a>
<ul>
<li><a href="#org54fc165">1.1. Signature</a></li>
<li><a href="#org3a452e5">1.2. Example</a></li>
<li><a href="#orgc61c60d">1.3. Mutability and Chaining</a>
<ul>
<li><a href="#org958cf58">1.3.1. <span class="underline">Exam Trick</span></a></li>
<li><a href="#orgb8b852a">1.3.2. Methods</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgb99e7b4" class="outline-2">
<h2 id="orgb99e7b4"><span class="section-number-2">1.</span> <code>StringBuilder</code></h2>
<div class="outline-text-2" id="text-1">
<p>
Unlike the <a href="20240103124304-creating_and_manipulating_strings.html#ID-afe76105-5f94-4dac-a929-e7a7dcdb5983">String class</a>, <code>StringBuilder</code> is <b>not</b> immutable.
For frequent or large-scale concatenation, <code>StringBuilder</code> (or <code>StringBuffer</code> for <b>thread</b> <b>safety</b>) is <b>more</b> <code>efficient</code> than the <code>+</code> operator or <code>concat()</code>.
</p>
</div>

<div id="outline-container-org54fc165" class="outline-3">
<h3 id="org54fc165"><span class="section-number-3">1.1.</span> Signature</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-java">StringBuilder sb1 = new StringBuilder(); // empty sequence of characters
StringBuilder sb2 = new StringBuilder("animal"); // animal
StringBuilder sb3 = new StringBuilder(10); // Initial capacity
</pre>
</div>
</div>
</div>

<div id="outline-container-org3a452e5" class="outline-3">
<h3 id="org3a452e5"><span class="section-number-3">1.2.</span> Example</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-java">StringBuilder alpha = new StringBuilder();
for (char current = 'a'; current &lt;= 'z'; current++) {
    alpha.append(current);
}
System.out.println(alpha); // abcdefghijklmnopqrstuvwxyz
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc61c60d" class="outline-3">
<h3 id="orgc61c60d"><span class="section-number-3">1.3.</span> Mutability and Chaining</h3>
<div class="outline-text-3" id="text-1-3">
<p>
When we chained <code>String</code> method calls, the result was a <b>new</b> <code>String</code> with the answer.
Chaining <code>StringBuilder</code> methods doesn’t work this way.
</p>

<p>
Instead, the <code>StringBuilder</code> <b>changes its own state and returns a reference to itself</b>:
</p>

<div class="org-src-container">
<pre class="src src-java">StringBuilder sb = new StringBuilder("start"); // sb = start

sb.append("+middle"); // sb = start+middle

StringBuilder same = sb.append("+end"); // sb = start+middle+end
</pre>
</div>
</div>

<div id="outline-container-org958cf58" class="outline-4">
<h4 id="org958cf58"><span class="section-number-4">1.3.1.</span> <span class="underline">Exam Trick</span></h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
There’s only <b>one</b> <code>StringBuilder</code> object here.
</p>

<p>
We know that because <code>new StringBuilder()</code> is called <b>only once</b>!
</p>

<div class="org-src-container">
<pre class="src src-java">StringBuilder a = new StringBuilder("abc");
StringBuilder b = a.append("de");
b = b.append("f").append("g");
System.out.println("a = " + a); // abcdefg
System.out.println("b = " + b); // abcdefg
</pre>
</div>

<p>
On <code>line 6</code>, those <b>two</b> variables are still <b>referring to that same object</b>, which now has a value of <code>"abcdefg"</code>.
</p>
</div>
</div>

<div id="outline-container-orgb8b852a" class="outline-4">
<h4 id="orgb8b852a"><span class="section-number-4">1.3.2.</span> Methods</h4>
<div class="outline-text-4" id="text-1-3-2">
</div>
<ol class="org-ol">
<li><a id="org382d557"></a><a href="20240106124543-stringbuilder_append.html#ID-6800ccf4-e0a1-41a9-8618-f952173bcb4d">StringBuilder.append</a><br /></li>
<li><a id="org2087c08"></a><a href="20240106124625-stringbuilder_insert.html#ID-0fd3d1f3-3241-4fd0-bcc4-71f7fa03d8cd">StringBuilder.insert</a><br /></li>
<li><a id="orge653319"></a><a href="20240106124954-stringbuilder_delete.html#ID-9808d612-53f4-4b51-b926-1c065047711c">StringBuilder.delete</a><br /></li>
<li><a id="orgc64d933"></a><a href="20240106125451-stringbuilder_replace.html#ID-5ec54700-2395-4cdc-9da2-ffbef6ec2c23">StringBuilder.replace</a><br /></li>
<li><a id="orgb9cf7e0"></a><a href="20240106125913-stringbuilder_reverse.html#ID-02412a54-508e-4f57-85e8-6bdd48508a92">StringBuilder.reverse</a><br /></li>
<li><a id="org61495a4"></a><a href="20240106130216-stringbuilder_tostring.html#ID-98a2b73f-e560-45c2-bcb1-40c6cd044777">StringBuilder.toString</a><br /></li>
</ol>
</div>
</div>
</div>
</div>
</body>
</html>
